src/cf/InformationRegisters/РасходыНаККТУменьшающиеНалог.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>РасходыНаККТУменьшающиеНалог</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РасходыУменьшающиеНалог</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НаименованиеККТ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЗаписьКалендаря</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗаписиКалендаряПодготовкиОтчетности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектУменьшенияНалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Патенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодПООКТМО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодИФНС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаводскойНомерККТ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РегистрационныйНомерККТ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/РасходыНаККТУменьшающиеНалог/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.ЗначенияЗаполнения.Свойство("ЗаписьКалендаря") Тогда
		Элементы.ЗаписьКалендаря.Видимость = Ложь;
		Элементы.ОбъектУменьшенияНалога.Видимость = Ложь;
		Элементы.КодПООКТМО.Видимость = Ложь;
		Элементы.КодИФНС.Видимость = Ложь;
		
	КонецЕсли;
	ПредельныйВычет = РегистрыСведений.РасходыНаККТУменьшающиеНалог.ПредельныйРазмерВычетаПоРасходамНаККТ();
	
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ЗаписьРасходыНаКТТ", Новый Структура("ЗаписьКалендаря, ОбъектУменьшенияНалога, КодПООКТМО, КодИФНС", Запись.ЗаписьКалендаря, Запись.ОбъектУменьшенияНалога, Запись.КодПООКТМО, Запись.КодИФНС));
КонецПроцедуры

&НаКлиенте
Процедура РасходыУменьшающиеНалогПриИзменении(Элемент)
	
	Если Запись.РасходыУменьшающиеНалог > ПредельныйВычет Тогда
		ТекстПредупреждения = СтрШаблон(НСтр("ru = 'Неверно указана сумма уменьшающих налог расходов на приобретение ККТ.
			|Максимально допустимая сумма - %1 руб.'"), ПредельныйВычет);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстПредупреждения,, "РасходыУменьшающиеНалог");
		Возврат;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
